       IDENTIFICATION DIVISION.
       PROGRAM-ID. ALUNO-ADICIONA-VIEW.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ALUNO PIC X(20) VALUE " ".
       LINKAGE SECTION.
       01 TOTAL-ALUNOS PIC 9(3) VALUE 0.
       01 LISTA.
           05 ALUNOS PIC X(20) OCCURS 20 TIMES.
       SCREEN SECTION.
       01  DATA-ENTRY-SCREEN.
           05  VALUE "ADICIONA ALUNO" BLANK SCREEN       LINE 1 COL 10.
           05  VALUE "Informe o nome do aluno:"          LINE 3 COL 10.
           05  RESPONSE-INPUT                            LINE 3 COL 35
                           PIC X(20) TO ALUNO.

       PROCEDURE DIVISION USING TOTAL-ALUNOS, LISTA.
            DISPLAY DATA-ENTRY-SCREEN.
            ACCEPT DATA-ENTRY-SCREEN.
            CALL "ALUNO-ADICIONA" USING ALUNO, TOTAL-ALUNOS, LISTA.
            MOVE " " TO RESPONSE-INPUT.
        EXIT PROGRAM.
