       IDENTIFICATION DIVISION.
       PROGRAM-ID. ALUNO-REMOVE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RTN-POSICAO-OCUPADA PIC 9(1) VALUE 0.
       01 POSICOES-A-MOVER PIC 9(3).
       01 I PIC 9(3) VALUE 1.
       LINKAGE SECTION.
       01 POSICAO PIC S9(3).
       01 STATUS-POSICAO PIC X(20).
       01 TOTAL-ALUNOS PIC 9(3) VALUE 0.
       01 LISTA.
           05 ALUNOS PIC X(20) OCCURS 20 TIMES.

       PROCEDURE DIVISION USING POSICAO, STATUS-POSICAO, 
                                TOTAL-ALUNOS, LISTA.
           PERFORM REMOVE.
       EXIT PROGRAM.

       REMOVE.
           CALL 'ALUNO-IS-POSICAO-OCUPADA' USING POSICAO, TOTAL-ALUNOS,
               RTN-POSICAO-OCUPADA.
           IF RTN-POSICAO-OCUPADA EQUAL 1 THEN
               COMPUTE I = POSICAO
               COMPUTE POSICOES-A-MOVER = TOTAL-ALUNOS - POSICAO + 1
               PERFORM POSICOES-A-MOVER TIMES
                   MOVE ALUNOS(I + 1) TO ALUNOS(I)
                   COMPUTE I = I + 1
               END-PERFORM
               COMPUTE TOTAL-ALUNOS = TOTAL-ALUNOS - 1
               MOVE "OK" TO STATUS-POSICAO
           ELSE
               MOVE "posicao invalida!" TO STATUS-POSICAO
           END-IF.
