       IDENTIFICATION DIVISION.
       PROGRAM-ID. ALUNO-IS-POSICAO-OCUPADA.

       DATA DIVISION.
       LINKAGE SECTION.
       01 POSICAO PIC S9(3).
       01 TOTAL-ALUNOS PIC 9(3) VALUE 0.
       01 RTN-POSICAO-OCUPADA PIC 9(1) VALUE 0.

       PROCEDURE DIVISION USING POSICAO, TOTAL-ALUNOS, 
                                RTN-POSICAO-OCUPADA.
           IF POSICAO >= 1 AND POSICAO < TOTAL-ALUNOS + 1 THEN
              COMPUTE RTN-POSICAO-OCUPADA = 1
           ELSE
              COMPUTE RTN-POSICAO-OCUPADA = 0
           END-IF.
       EXIT PROGRAM.
