       IDENTIFICATION DIVISION.
       PROGRAM-ID. ALUNO-IS-CONTEM.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 I PIC 9(3) VALUE 1.
       LINKAGE SECTION.
       01 ALUNO PIC X(20).
       01 TOTAL-ALUNOS PIC 9(3) VALUE 0.
       01 LISTA.
           05 ALUNOS PIC X(20) OCCURS 20 TIMES.
       01 RTN-BUSCA PIC 9(3) VALUE 0.

       PROCEDURE DIVISION USING ALUNO, TOTAL-ALUNOS, LISTA, RTN-BUSCA.
           PERFORM IS-CONTEM.
       EXIT PROGRAM.

       IS-CONTEM.
           COMPUTE I = 0.
           COMPUTE RTN-BUSCA = 0.
           PERFORM VARYING I FROM 1 BY 1 UNTIL I > TOTAL-ALUNOS
               IF ALUNOS(I) EQUAL ALUNO THEN
                   COMPUTE RTN-BUSCA = I
                   COMPUTE I = TOTAL-ALUNOS + 1
               END-IF
           END-PERFORM.
