       IDENTIFICATION DIVISION.
       PROGRAM-ID. ALUNO-PEGA.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RTN-POSICAO-OCUPADA PIC 9(1) VALUE 0.
       LINKAGE SECTION.
       01 POSICAO PIC s9(3).
       01 TOTAL-ALUNOS PIC 9(3) VALUE 0.
       01 LISTA.
           05 ALUNOS PIC x(20) OCCURS  20 TIMES.

       PROCEDURE DIVISION USING POSICAO, TOTAL-ALUNOS, LISTA.
           PERFORM PEGA.
       EXIT PROGRAM.

       PEGA.
           CALL 'ALUNO-IS-POSICAO-OCUPADA' USING POSICAO, TOTAL-ALUNOS,
               RTN-POSICAO-OCUPADA.

           IF RTN-POSICAO-OCUPADA EQUAL 1 THEN
               DISPLAY ALUNOS(POSICAO)
           ELSE
               DISPLAY "posição inválida!"
           END-IF.
